STclab/stm32nucleo-st7580-lib/drivers/st7580/src/ST7580_Serial.c
/**
******************************************************************************
* @file    ST7580_Serial.c
* @author  CLABS
* @version V1.0.0
* @date    8-Nov-2017 
* @brief   ST7580 device specific interface functions and constants
******************************************************************************
* @attention
*
* <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*   1. Redistributions of source code must retain the above copyright notice,
*      this list of conditions and the following disclaimer.
*   2. Redistributions in binary form must reproduce the above copyright notice,
*      this list of conditions and the following disclaimer in the documentation
*      and/or other materials provided with the distribution.
*   3. Neither the name of STMicroelectronics nor the names of its contributors
*      may be used to endorse or promote products derived from this software
*      without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
* CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
* OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
* OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************
*/
#include "contiki.h"

#include "cube_hal.h"
#include "ST7580_Serial.h"
#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include "stm32_plm01a1.h"
#include "plm_gpio.h"
#include "st7580.h"



/**
 * @addtogroup ST7580_Libraries
 * @{
 */


/**
 * @addtogroup ST7580_Serial
 * @{
 */
 
 
/**
 * @defgroup Serial_Private_TypesDefinitions  Serial Private TypesDefinitions
 * @{
 */

/**
 *@}
 */


/**
 * @defgroup Serial_Private_Defines           Serial Private Defines
 * @{
 */

/**
 *@}
 */

/**
 * @defgroup Serial_Private_Macros            Serial Private Macros
 * @{
 */

/**
 *@}
 */

/**
 * @defgroup Serial_Private_Functions            Serial Private Functions
 * @{
 */

static bool ST7580TmoExpired(uint8_t tmoIdx);
static void ST7580TmoSet(uint8_t tmoIdx, uint32_t tmo);
static void ST7580FrameChecksum(ST7580Frame* frame);
static bool ST7580FrameReady(void);
static ST7580Frame* ST7580RecvConfirm(void);
static int ST7580SendFrame(ST7580Frame *frame);

/**
 *@}
 */

/**
 * @defgroup Serial_Private_Variables         Serial Private Variables
 * @{
 */

/**
* @brief  Instance of ST7580Channel struct used through the application
*/
static ST7580Channel ch;
uint8_t initialized = 0;

/**
* @brief ST7580 PHY configuration parameters fitting
*/
const uint8_t phy_config[14] = {0x01, 0xC9, 0x08, 0x01, 0x8E, 0x70, 0x0E,\
																			 0x15, 0x00, 0x00, 0x02, 0x35, 0x9B, 0x58};

/**
* @brief ST7580 MODEM configuration parameters fitting
*/
#ifdef USE_PHY_DATA
	const uint8_t modem_config[1] = {0x00};
#endif

/**
* @brief ST7580 MODEM configuration parameters fitting
*/	
#ifdef USE_DL_DATA
	const uint8_t modem_config[1] = {0x11};
#endif



/**
 *@}
 */

/** @defgroup Serial_Private_FunctionPrototypes       Serial Private FunctionPrototypes
 * @{
 */



/**
 * @}
 */



/** @defgroup Serial_Private_Functions                 Serial Private Functions
 * @{
 */

/**
* @brief  Initialize the ST7580 channel
* @param  None
* @retval None
*/
void ST7580InitChannel()
{
	uint8_t i;
	Timeout tmo_ini = {0,0};
	
	ch.ack_rx = false;
	ch.status_rx = false;
	ch.confirm_rx = false;
	ch.local_frame_tx = false;
	ch.ack_tx = false;
	ch.wait_ack = false;
	ch.wait_status = false; 
	for (i=0;i<N_TIMEOUTS;i++)
	{
		ch.timeout[i] = tmo_ini;
	}
	ch.ind_frames.rd_idx = 0;
	ch.ind_frames.wr_idx = 0;
}

/**
* @brief  Initializes ST7580 UART and GPIOs interfaces and wait for PLC Modem start.
* @param  None
* @retval None
*/
void ST7580InterfaceInit( void )
{
  ST7580Frame* rx_frame;
  ST7580InitChannel();

  HAL_GPIO_WritePin(PLM_GPIO_RESETN_PORT,PLM_GPIO_RESETN_PIN,GPIO_PIN_RESET);
  HAL_Delay(500);
  HAL_GPIO_WritePin(PLM_GPIO_RESETN_PORT,PLM_GPIO_RESETN_PIN,GPIO_PIN_SET);
  
  /* Wait first indication frame after reset */
  do
  {
    rx_frame = ST7580NextIndicationFrame();
  } while((rx_frame==NULL)||(rx_frame->command != CMD_RESET_IND));
  return;
}

/**
* @brief  Reset ST7580 PLC Modem.
* @param  None
* @retval None
*/
int ST7580Reset()
{
	int ret;
  ST7580Frame* rxframe = NULL;
	
  ch.tx_frame.stx = ST7580_STX_02;
  ch.tx_frame.command = CMD_RESET_REQ;
  ch.tx_frame.length = 0;
  
  /* Update the checksum */
  ST7580FrameChecksum(&(ch.tx_frame));
  /* Send frame */
	while ((ret=ST7580SendFrame(&(ch.tx_frame))) == ST7580_TX_IN_PROGRESS);
	if (ret != ST7580_OK)
	{
		return ret;
	}
  
  /* Wait for response */
  ST7580TmoSet(CMD_TMO_IDX, CMD_TMO);
	while(!ST7580FrameReady() && !ST7580TmoExpired(CMD_TMO_IDX)){};
  /* No response, timeout expired */
  if (ST7580TmoExpired(CMD_TMO_IDX))
  {
    return ST7580_ERR_TIMEOUT;
  }
  rxframe = ST7580RecvConfirm(); 
  /* Confirmation frame not correct */
  if (rxframe->command != CMD_RESET_CNF)
  {
    return ST7580_ERR_CONFIRM;
  }
  /* Command confirmed */
  return 0;
}

/**
* @brief  Write ST7580 PLC Modem MIB parameter.
* @param  indexMib	Selects MIB parameter to be written
* @param  bufMib   Pointer to buffer containing value to be written
* @param  lenBuf		Length of buffer pointed by buf
* @retval 0 command confirmed, error code otherwise
*/
int ST7580MibWrite(uint8_t indexMib, const uint8_t* bufMib, uint8_t lenBuf)
{
  int ret;
  ST7580Frame* rxframe = NULL;
  
  ch.tx_frame.stx = ST7580_STX_02;
  ch.tx_frame.command = CMD_MIB_WRITE_REQ;
  ch.tx_frame.length = lenBuf + 1;
  ch.tx_frame.data[0] = indexMib;
  memcpy(&(ch.tx_frame.data[1]), bufMib, lenBuf);
  /* update the checksum */
  ST7580FrameChecksum(&(ch.tx_frame));
  /* Send frame */
	while ((ret=ST7580SendFrame(&(ch.tx_frame))) == ST7580_TX_IN_PROGRESS);
	if (ret != ST7580_OK)
	{
		return ret;
	}
  /* wait for response */
  ST7580TmoSet(CMD_TMO_IDX, CMD_TMO);
	while(!ST7580FrameReady() && !ST7580TmoExpired(CMD_TMO_IDX)){};
  /* No response, timeout expired */
  if (ST7580TmoExpired(CMD_TMO_IDX))
  {
    return ST7580_ERR_TIMEOUT;
  }
	/* Get the received frame */
  rxframe = ST7580RecvConfirm();
  if (rxframe->command == CMD_MIB_WRITE_ERR)
  {
    /* Error frame received, return received error code */
    return rxframe->data[0];
  }
  else if (rxframe->command != CMD_MIB_WRITE_CNF)
  {
    /* Confirmation frame not correct */
    return ST7580_ERR_CONFIRM;
  }
  /* Command confirmed */
  return 0;
}
  
/**
* @brief  Read ST7580 PLC Modem MIB parameter.
* @param  indexMib	Selects MIB parameter to be read
* @param  bufMib   Pointer to buffer to store read value
* @param  lenBuf		Length of buffer pointed by buf
* @retval 0 command confirmed, error code otherwise
*/
int ST7580MibRead(uint8_t indexMib, uint8_t* bufMib, uint8_t lenBuf)
{
	int ret;
  ST7580Frame* rxframe = NULL;
  
  ch.tx_frame.stx = ST7580_STX_02;
  ch.tx_frame.command = CMD_MIB_READ_REQ;
  ch.tx_frame.length = 1;
  ch.tx_frame.data[0] = indexMib;
  
  /* Update the checksum */
  ST7580FrameChecksum(&(ch.tx_frame));
  /* Send frame */
	while ((ret=ST7580SendFrame(&(ch.tx_frame))) == ST7580_TX_IN_PROGRESS);
	if (ret != ST7580_OK)
	{
		return ret;
	}
  
  /* Wait for response */
  ST7580TmoSet(CMD_TMO_IDX, CMD_TMO);
	while(!ST7580FrameReady() && !ST7580TmoExpired(CMD_TMO_IDX)){};
  /* No response, timeout expired */
  if (ST7580TmoExpired(CMD_TMO_IDX))
  {
    return ST7580_ERR_TIMEOUT;
  }
	/* Get the received frame */
  rxframe = ST7580RecvConfirm();
    
  if (rxframe->command == CMD_MIB_READ_ERR)
  {
    /* Error frame received, return received error code */
    return rxframe->data[0];
  }
  else if (rxframe->command != CMD_MIB_READ_CNF)
  {
    /* Confirmation frame not correct */
    return ST7580_ERR_CONFIRM;
  }
  if (rxframe->length > lenBuf)
  {
    /* Provided buffer is not long enough, return error */
    return ST7580_ERR_BUF_LEN;
  }
  memcpy(bufMib, rxframe->data, rxframe->length);
  /* Command confirmed */
  return 0;
}


/**
* @brief  Erase ST7580 PLC Modem MIB parameter.
* @param  indexMib	Selects MIB parameter to be erased
* @retval 0 command confirmed, error code otherwise
*/
int ST7580MibErase(uint8_t indexMib)
{
	int ret;
  ST7580Frame* rxframe = NULL;
  
  ch.tx_frame.stx = ST7580_STX_02;
  ch.tx_frame.command = CMD_MIB_ERASE_REQ;
  ch.tx_frame.length = 1;
  ch.tx_frame.data[0] = indexMib;
  
  /* Update the checksum */
  ST7580FrameChecksum(&(ch.tx_frame));
  /* Send frame */
	while ((ret=ST7580SendFrame(&(ch.tx_frame))) == ST7580_TX_IN_PROGRESS);
	if (ret != ST7580_OK)
	{
		return ret;
	}
    
  /* Wait for response */
  ST7580TmoSet(CMD_TMO_IDX, CMD_TMO);
	while(!ST7580FrameReady() && !ST7580TmoExpired(CMD_TMO_IDX)){};
  /* No response, timeout expired */
  if (ST7580TmoExpired(CMD_TMO_IDX))
  {
    return ST7580_ERR_TIMEOUT;
  }
	/* Get the received frame */
  rxframe = ST7580RecvConfirm();
  
