STclab/stm32nucleo-st7580-lib/drivers/st7580/src/ST7580_Serial.c
  if (rxframe->command == CMD_MIB_ERASE_ERR)
  {
    /* Error frame received, return received error code */
    return rxframe->data[0];
  }
  else if (rxframe->command != CMD_MIB_ERASE_CNF)
  {
    /* Confirmation frame not correct */
    return ST7580_ERR_CONFIRM;
  }
  
  /* Command confirmed */
  return 0;
}

/**
* @brief  Ping ST7580 PLC Modem.
* @param  pingBuf   Pointer to buffer containing ping test data to be sent.
								If ping is success ST7580 PLC Modem will reply with the same
								data
* @param  pingLen		Length of buffer pointed by buf
* @retval 0 command confirmed, error code otherwise
*/
int ST7580Ping(const uint8_t* pingBuf, uint8_t pingLen)
{
	int ret;
  ST7580Frame* rxframe = NULL;
    
  ch.tx_frame.stx = ST7580_STX_02;
  ch.tx_frame.command = CMD_PING_REQ;
  ch.tx_frame.length = pingLen;
  memcpy(&(ch.tx_frame.data[1]), pingBuf, pingLen);
  
	/* Update the checksum */
  ST7580FrameChecksum(&(ch.tx_frame));
	/* Send frame */
	while ((ret=ST7580SendFrame(&(ch.tx_frame))) == ST7580_TX_IN_PROGRESS);
	if (ret != ST7580_OK)
	{
		return ret;
	}
  
  /* Wait for response */
  ST7580TmoSet(CMD_TMO_IDX, CMD_TMO);
	while(!ST7580FrameReady() && !ST7580TmoExpired(CMD_TMO_IDX)){};
  /* No response, timeout expired */
  if (ST7580TmoExpired(CMD_TMO_IDX))
  {
    return ST7580_ERR_TIMEOUT;
  }
	/* Get received frame */
  rxframe = ST7580RecvConfirm();
  if (rxframe->command != CMD_PING_CNF)
  {
    /* Confirmation frame not correct */
    return ST7580_ERR_CONFIRM;
  }
  if (!memcmp(rxframe->data, pingBuf, pingLen))
  {
    return ST7580_ERR_PING;
  }
  /* Command confirmed */
  return 0;
}

/**
* @brief  Send data via PLC in PHY mode.
* @param  plmOpts  Transmission options
* @param  dataBuf		Pointer to buffer containing data to be sent.
* @param  dataLen		Length of buffer pointed by buf
* @param	confData	Pointer to buffer to store transmission confirmation data
					from ST7580 PLC Modem, if requested
* @retval 0 command confirmed, error code otherwise
*/
int ST7580PhyData(uint8_t plmOpts, const uint8_t* dataBuf, uint8_t dataLen, uint8_t* confData)
{
  int ret;
	ST7580Frame* rxframe = NULL;
	uint8_t	offset = 1;
	
	if (dataLen > PHY_DATALEN_MAX)
	{
		return ST7580_ERR_ARGS;
	}
  
  ch.tx_frame.stx = ST7580_STX_02;
  ch.tx_frame.command = CMD_PHY_DATA_REQ;
  ch.tx_frame.length = dataLen + 1;
  ch.tx_frame.data[0] = plmOpts;
	
#if CUSTOM_MIB_FREQUENCY
	ch.tx_frame.data[1] = TXFREQ1;
	ch.tx_frame.data[2] = TXFREQ2;
	ch.tx_frame.data[3] = TXFREQ3;
	offset+=3;
#endif
	
#if GAIN_SELECTOR
	ch.tx_frame.data[offset] = TXGAIN;
	offset+=1;
#endif	
	
  memcpy(&(ch.tx_frame.data[offset]), dataBuf, dataLen);
  
	/* Update the checksum */
  ST7580FrameChecksum(&(ch.tx_frame));
	/* Send frame */
	while ((ret=ST7580SendFrame(&(ch.tx_frame))) == ST7580_TX_IN_PROGRESS);
	if (ret != ST7580_OK)
	{
		return ret;
	}
    
  /* Wait for response */
  ST7580TmoSet(CMD_TMO_IDX, CMD_TMO);
	while(!ST7580FrameReady() && !ST7580TmoExpired(CMD_TMO_IDX)){};
  /* No response, timeout expired */
  if (ST7580TmoExpired(CMD_TMO_IDX))
  {
    return ST7580_ERR_TIMEOUT;
  }

	/* Get received frame */
  rxframe = ST7580RecvConfirm();
  if (rxframe->command == CMD_PHY_DATA_ERR)
  {
    /* Error frame received, return received error code */
    return rxframe->data[0];
  }
  else if (rxframe->command != CMD_PHY_DATA_CNF)
  {
    /* Confirmation frame not correct */
    return ST7580_ERR_CONFIRM;
  }
  
  if (confData)
  {
    /* Return data was requested, copy it */
    memcpy(confData, rxframe->data, 5);
  }
  /* Command confirmed */
  return 0;
}

/**
* @brief  Send data via PLC in DL mode.
* @param  plmOpts  Transmission options
* @param  dataBuf		Pointer to buffer containing data to be sent.
* @param  dataLen		Length of buffer pointed by buf
* @param	confData	Pointer to buffer to store transmission confirmation data
					from ST7580 PLC Modem, if requested
* @retval 0 command confirmed, error code otherwise
*/
int ST7580DlData(uint8_t plmOpts, const uint8_t* dataBuf, uint8_t dataLen, uint8_t* confData)
{
  int ret;
  ST7580Frame* rxframe = NULL;
  uint8_t offset = 1;
	
  if (dataLen > DL_DATALEN_MAX)
  {
    return ST7580_ERR_ARGS;
  }
  
  ch.tx_frame.stx = ST7580_STX_02;
  ch.tx_frame.command = CMD_DL_DATA_REQ;
  ch.tx_frame.length = dataLen + 1;
  ch.tx_frame.data[0] = plmOpts;	

#if CUSTOM_MIB_FREQUENCY
  ch.tx_frame.data[1] = TXFREQ1;
  ch.tx_frame.data[2] = TXFREQ2;
  ch.tx_frame.data[3] = TXFREQ3;
  offset+=3;
#endif
	
#if GAIN_SELECTOR
  ch.tx_frame.data[offset] = TXGAIN;
  offset+=1;
#endif
	
  memcpy(&(ch.tx_frame.data[offset]), dataBuf, dataLen);
  
  /* Update the checksum */
  ST7580FrameChecksum(&(ch.tx_frame));
  /* Send frame */
  while ((ret=ST7580SendFrame(&(ch.tx_frame))) == ST7580_TX_IN_PROGRESS);
  if (ret != ST7580_OK)
  {
    return ret;
  }
  
  /* Wait for response */
  ST7580TmoSet(CMD_TMO_IDX, CMD_TMO);
  while(!ST7580FrameReady() && !ST7580TmoExpired(CMD_TMO_IDX)){};
  /* No response, timeout expired */
  if (ST7580TmoExpired(CMD_TMO_IDX))
  {
    return ST7580_ERR_TIMEOUT;
  }
  rxframe = ST7580RecvConfirm();
  if (rxframe->command == CMD_DL_DATA_ERR)
  {
    /* Error frame received, return received error code */
    return rxframe->data[0];
  }
  else if (rxframe->command != CMD_DL_DATA_CNF)
  {
    /* Confirmation frame not correct */
    return ST7580_ERR_CONFIRM;
  } 
  if (confData)
  {
    /* Return data was requested, copy it */
    memcpy(confData, rxframe->data, 5);
  }
  /* Command confirmed */
  return 0;
}

/**
* @brief  Send data via PLC in SS mode.
* @param  plmOpts Transmission options
* @param  dataBuf	Pointer to buffer containing data to be sent.
* @param  clrLen Buf portion that has to be sent in clear
* @param  encLen Buf portion that has to be encypted
* @param	retData	Pointer to buffer to store transmission confirmation data
					from ST7580 PLC Modem, if requested
* @retval 0 command confirmed, error code otherwise
*/
int ST7580SsData(uint8_t plmOpts, const uint8_t* dataBuf, uint8_t clrLen, uint8_t encLen, uint8_t* retData)
{
	int ret;
  ST7580Frame* rxframe = NULL;
	uint8_t offset = 1;
	
  uint16_t len = clrLen + encLen;
  
  if ((len > SS_DATALEN_MAX) || ((encLen == 0) && (clrLen < 16)) || ((encLen > 0) && (len < 4)))
  {
    return ST7580_ERR_ARGS;
  }
  
  ch.tx_frame.stx = ST7580_STX_02;
  ch.tx_frame.command = CMD_SS_DATA_REQ;
  ch.tx_frame.length = len + 2;
  ch.tx_frame.data[0] = plmOpts;
	
#if CUSTOM_MIB_FREQUENCY
	ch.tx_frame.data[1] = TXFREQ1;
	ch.tx_frame.data[2] = TXFREQ2;
	ch.tx_frame.data[3] = TXFREQ3;
	offset+=3;
#endif	
#if GAIN_SELECTOR
	ch.tx_frame.data[offset] = TXGAIN;
	offset+=1;
#endif
	ch.tx_frame.data[offset] = clrLen;
  memcpy(&(ch.tx_frame.data[offset+1]), dataBuf, len);
  
  /* Update the checksum */
  ST7580FrameChecksum(&(ch.tx_frame));
	/* Send frame */
	while ((ret=ST7580SendFrame(&(ch.tx_frame))) == ST7580_TX_IN_PROGRESS);
	if (ret != ST7580_OK)
	{
		return ret;
	}
  
  /* Wait for response */
  ST7580TmoSet(CMD_TMO_IDX, CMD_TMO);
	while(!ST7580FrameReady() && !ST7580TmoExpired(CMD_TMO_IDX)){};
  /* No response, timeout expired */
  if (ST7580TmoExpired(CMD_TMO_IDX))
  {
    return ST7580_ERR_TIMEOUT;
  }
  
	/* Get the received frame */
  rxframe = ST7580RecvConfirm();
  
  if (rxframe->command == CMD_SS_DATA_ERR)
  {
    /* Error frame received, return received error code */
    return rxframe->data[0];
  }
  else if (rxframe->command != CMD_SS_DATA_CNF)
  {
    /* Confirmation frame not correct */
    return ST7580_ERR_CONFIRM;
  }
  
  if (retData)
  {
    /* Return data was requested, copy it */
    memcpy(retData, rxframe->data, 5);
  }
  
