STclab/stm32nucleo-st7580-lib/drivers/st7580/src/ST7580_Serial.c
  /* Command confirmed */
  return 0;
}

/**
* @brief  Get next ST7580 PLC Modem indication frame.
* @param  None
* @retval NULL if no indication frame is available, pointer no next indication
					frame otherwise
*/
ST7580Frame *ST7580NextIndicationFrame()
{
	ST7580Frame *ret_frame = NULL;

	if (ch.ind_frames.rd_idx != ch.ind_frames.wr_idx)
	{
		ret_frame = &(ch.ind_frames.frames[ch.ind_frames.rd_idx++]);
		if (ch.ind_frames.rd_idx == IND_FRAMES_QUEUE_LEN)
		{
			ch.ind_frames.rd_idx = 0;
		}
	}
	/* Return the frame or NULL */
	return ret_frame;
}

/**
* @brief  Check if a timeout is expired
* @param  tmoIdx Index of the timeout to be checked
* @retval true is a timeout is expired, false otherwise
*/
static bool ST7580TmoExpired(uint8_t tmoIdx)
{
	uint32_t time;

	time = HAL_GetTick();
	if (time >= ch.timeout[tmoIdx].tmo_start_time)
	{
		return (time - ch.timeout[tmoIdx].tmo_start_time) >= ch.timeout[tmoIdx].tmo;
	}
	else
	{
		return (time + (0xFFFFFFFF - ch.timeout[tmoIdx].tmo_start_time) >= ch.timeout[tmoIdx].tmo); 
	}
}

/**
* @brief  Check if a timeout is expired
* @param  tmoIdx Index of the timeout to be checked
* @retval None
*/
static void ST7580TmoSet(uint8_t tmo_idx, uint32_t tmo)
{
	ch.timeout[tmo_idx].tmo = tmo;
	ch.timeout[tmo_idx].tmo_start_time = HAL_GetTick();
}

/**
* @brief  Computes the checksum of a frame
* @param  frame Input frame for timeout coumputing
* @retval None
*/
static void ST7580FrameChecksum(ST7580Frame* frame)
{
  uint8_t i;
  
  frame->checksum = frame->command + frame->length; 
  for (i = 0; i < frame->length; i++)
  {
    frame->checksum += frame->data[i];
  }
}

/**
* @brief  Check if a confirm frame has been received
* @param  None
* @retval true if a frame has beeen received, false otherwise
*/
static bool ST7580FrameReady()
{
	if (ch.confirm_rx)
	{
		ch.confirm_rx = false;
		return true;
	}
	return false;
}

/**
* @brief  Get the received confirm frame
* @param  None
* @retval The received confirm frame
*/
static ST7580Frame* ST7580RecvConfirm()
{
  return &(ch.confirm_frame);
}

/**
* @brief  State machine for local frame receive
* @param  step Current iteration state machine step
* @retval Next iteration state machine step
*/
static RxIrqStatus ST7580RcvLocalFrame(RxIrqStatus step, uint8_t c)
{
	static uint8_t len, i;
	static uint16_t checksum;
	static volatile ST7580Frame *local_frame;
	static bool rcv_indication;
	
	switch(step)
	{
		/* Receive length */
		case RCV_LENGTH:
			len = c;
			ch.confirm_frame.length = len;
			ch.ind_frames.frames[ch.ind_frames.wr_idx].length = len;
			checksum = c;
			ST7580TmoSet(IC_TMO_IDX,IC_TMO);
			step = RCV_COMMAND;
			break; 
		
		/* Receive command */
		case RCV_COMMAND:
			if (IS_INDICATION(c))
			{
				rcv_indication = true;
				local_frame = &(ch.ind_frames.frames[ch.ind_frames.wr_idx]);
			}
			else
			{
				rcv_indication = false;
				local_frame = &(ch.confirm_frame);
			}
			local_frame->command = c;
			checksum += c;
			i = 0;
			ST7580TmoSet(IC_TMO_IDX,IC_TMO);		
			if (local_frame->length == 0)
			{
				step = RCV_CHECKSUM_LSB;
			}
			else
			{
				step = RCV_DATA;
			}
			break;
		
		/* Receive Data */
		case RCV_DATA:
			local_frame->data[i++] = c;
			checksum += c;
			ST7580TmoSet(IC_TMO_IDX,IC_TMO);
			if (i==len)
			{
				step = RCV_CHECKSUM_LSB;
			}
			break;
		
		/* Receive Checksum LSB */
		case RCV_CHECKSUM_LSB:
			local_frame->checksum = c;
			ST7580TmoSet(IC_TMO_IDX,IC_TMO);
			step = RCV_CHECKSUM_MSB;
			break;
	
		/* Receive Checksum MSB */
		case RCV_CHECKSUM_MSB:	
			local_frame->checksum |= ((uint16_t)(c<<8));	
			/* Send ack */
			ch.ack_tx = true;
			if (local_frame->checksum == checksum)
			{
				if (!rcv_indication)
				{
					/* Validate local frame */
					ch.confirm_rx = true;
				}
				else
				{
					/* Advance the indication frame queue */
					ch.ind_frames.wr_idx++;				
					if (ch.ind_frames.wr_idx == IND_FRAMES_QUEUE_LEN)
					{
						ch.ind_frames.wr_idx = 0;
					}
				}				
				/* Ack value */
				ch.ack_tx_value = ST7580_ACK;
			}
			else
			{
				/* Nak value */
				ch.ack_tx_value = ST7580_NAK;
			}
			/* Triggers transmission interrupt */
			__HAL_UART_ENABLE_IT(&pUartPlmHandle,UART_IT_TXE);			
			step = RCV_FIRST_BYTE;
			break;
		
		/* Default status to never be reached */
		default:
			break;
	}

	return step;
}

/**
* @brief  Rx interrupt state machine
* @param  Uarthandle Handle for ST7580 serial communication
* @retval None
*/
void NucleoST7580RxInt(UART_HandleTypeDef* UartHandle)
{
	/* Wait for first byte */
	static RxIrqStatus step = RCV_FIRST_BYTE;
	uint8_t c;
	
	/* First check whether a timeout is expired or not */
	if (ST7580TmoExpired(IC_TMO_IDX))
	{
		/* Reset state machine */
		step = RCV_FIRST_BYTE;
	}
	
	/* Get received character; */
	//c = LL_USART_ReceiveData8(UartHandle->Instance);
	c = (UartHandle->Instance)->DR;
	
	/* Switch on RX status */
	switch(step)
	{
		/* Wait for first byte */
		case RCV_FIRST_BYTE:
			/* Switch on received character */
			switch(c)
			{
				case ST7580_ACK:
				case ST7580_NAK:					
					if(ch.wait_ack)
					{	
						ch.ack_rx = true;
						ch.ack_rx_value = c;
						ch.wait_ack = false;
					}
					else
					{
						ch.wait_status = false;
					}				
					break;
				
				case ST7580_STX_02:	
				case ST7580_STX_03:
					ch.confirm_frame.stx = c;
					ch.ind_frames.frames[ch.ind_frames.wr_idx].stx = c;
					ST7580TmoSet(IC_TMO_IDX,IC_TMO);
					step = RCV_LENGTH;
					break;
				
				case ST7580_STX_STATUS:
					if (ch.wait_status)
					{
						ST7580TmoSet(IC_TMO_IDX,IC_TMO);
						step = RCV_STATUS_VALUE;
					}
					else
					{
						ch.wait_ack = false;
					}
					break;
				default:
					ch.wait_status = false;
					ch.wait_ack = false;
					break;
			}
			break;
			
		/* Receive Status Byte */
		case RCV_STATUS_VALUE:
			ch.status_value = c;
			ch.status_rx = true;
			step = RCV_FIRST_BYTE;
			ch.wait_status = false;
			break;
		
