STclab/stm32nucleo-st7580-lib/drivers/st7580/src/ST7580_Serial.c
		/* Receive Local Frame */
		default:
			step = ST7580RcvLocalFrame(step, c);
                        if ((step == RCV_FIRST_BYTE)&&(initialized!=0)){
                                wrapped_callback(ST7580NextIndicationFrame());
                        }			
			break;
	}
}


/**
* @brief  Tx interrupt state machine
* @param  Uarthandle Handle for ST7580 serial communication
* @retval None
*/
void NucleoST7580TxInt(UART_HandleTypeDef* UartHandle)
{
	static TxIrqStatus step = SEND_STX;
	static uint8_t i = 0;
	
	/* Send ack or nack, if requested */
	if (ch.ack_tx)
	{
		(UartHandle->Instance)->DR = ch.ack_tx_value;
		//LL_USART_TransmitData8(UartHandle->Instance,ch.ack_tx_value);
		step = TX_DONE;
	}
	/* Switch on tx status */
	switch(step)
	{
		/* Send STX character */
		case SEND_STX: 
			(UartHandle->Instance)->DR = ch.tx_frame.stx;
			//LL_USART_TransmitData8(UartHandle->Instance,ch.tx_frame.stx);
			step = SEND_LENGTH;
			break;
		
		/* Send length */
		case SEND_LENGTH:
			HAL_GPIO_WritePin(PLM_GPIO_T_REQ_PORT,PLM_GPIO_T_REQ_PIN,GPIO_PIN_SET);
			(UartHandle->Instance)->DR = ch.tx_frame.length;
			//LL_USART_TransmitData8(UartHandle->Instance,ch.tx_frame.length);			
			step = SEND_COMMAND;
			break;
		
		/* Send data */
		case SEND_COMMAND:;
			(UartHandle->Instance)->DR = ch.tx_frame.command;
			//LL_USART_TransmitData8(UartHandle->Instance,ch.tx_frame.command);			
			step = SEND_DATA;
			break; 
		
		/* Send data */
		case SEND_DATA:
			if (i == ch.tx_frame.length)
			{
				step = SEND_CHECKSUM_LSB;
			}
			else
			{
			  (UartHandle->Instance)->DR = ch.tx_frame.data[i++];
			  //LL_USART_TransmitData8(UartHandle->Instance,ch.tx_frame.data[i++]);
			}
			break; 
		
		/* Send checksum (LSB) */
		case SEND_CHECKSUM_LSB:
			(UartHandle->Instance)->DR = ch.tx_frame.checksum;
			//LL_USART_TransmitData8(UartHandle->Instance,ch.tx_frame.checksum);		
			step = SEND_CHECKSUM_MSB;
			break;
		
		/* Send checksum (MSB) */
		case SEND_CHECKSUM_MSB:
			(UartHandle->Instance)->DR = ch.tx_frame.checksum >> 8;
			//LL_USART_TransmitData8(UartHandle->Instance,ch.tx_frame.checksum >> 8);		
			step = TX_DONE;
			break;
		
		/* TX DONE */
		case TX_DONE:
			/* Interrupt acknowledge */
			__HAL_UART_DISABLE_IT(UartHandle,UART_IT_TXE);
			
			if (!ch.ack_tx)
			{
				/* If we sent a local frame */
				ch.local_frame_tx = true;
			}
			else
			{
				ch.ack_tx = false;
			}
			
			step = SEND_STX;
			i = 0;
			break;
	}
}


/**
* @brief  Send frame state machine
* @param  frame Frame to be sent
* @retval Next iteration state machine's step
*/
static int ST7580SendFrame(ST7580Frame *frame)
{
	static TxStatus step = TXREQ_LOW;
	int ret = ST7580_TX_IN_PROGRESS;
	static bool firstIter = true;
		
	/* Switch on tx state machine step */
	switch(step)
	{
		/* Pull down the TXREQ */
		case TXREQ_LOW:
			/* Frame not sent yet */
			ch.local_frame_tx = false;
			/* Status frame not received yet */
			ch.status_rx = false;	
			/* Pull down the T_REQ */
			HAL_GPIO_WritePin(PLM_GPIO_T_REQ_PORT,PLM_GPIO_T_REQ_PIN,GPIO_PIN_RESET);				
			/* Initialize the status message rcv time */
			ST7580TmoSet(STATUS_MSG_TMO_IDX, STATUS_MSG_TMO);
			/* Wait for status frame */
			step = WAIT_STATUS_FRAME;
			break;
		
		/* Wait for receival of Status frame */
		case WAIT_STATUS_FRAME:
			if (firstIter)
			{
				ch.wait_status = true;
				firstIter = false;
			}
			/* Check for timeout expiration */
			if (!ST7580TmoExpired(STATUS_MSG_TMO_IDX))
			{
				if (ch.status_rx)
				{			
					/* Check for busyness */
					if (ch.status_value & BUSY_MASK)
					{
						HAL_GPIO_WritePin(PLM_GPIO_T_REQ_PORT,PLM_GPIO_T_REQ_PIN,GPIO_PIN_SET);
						step = TXREQ_LOW;
						ret =  ST7580_TXERR_BUSY;
					}
					else
					{
						/* Triggers TX interrupt */
							step = WAIT_TX_FRAME_DONE;
							__HAL_UART_ENABLE_IT(&pUartPlmHandle,UART_IT_TXE);
					}
					firstIter = true;				
				}
				
					
			}
			else
			{
				HAL_GPIO_WritePin(PLM_GPIO_T_REQ_PORT,PLM_GPIO_T_REQ_PIN,GPIO_PIN_SET);
				step = TXREQ_LOW;
				ret =  ST7580_TXERR_NO_STATUS;
				ch.wait_status = false;
				firstIter = true;
			}
			break;
		
		/* Wait for end of frame transmission */
		case WAIT_TX_FRAME_DONE:
			if (ch.local_frame_tx == true)
			{
				ST7580TmoSet(ACK_TMO_IDX, ACK_TMO);
				step = WAIT_ACK;
			}
			break;
			
		/* Wait for the acknoledgement */
		case WAIT_ACK:
			if (firstIter)
			{
				ch.wait_ack = true;
				firstIter = false;
			}
			if (!ST7580TmoExpired(ACK_TMO_IDX))
			{
				if (ch.ack_rx)
				{
					/* Consume the acknowledgement */
					ch.ack_rx = false;					
					/* Set the return value */
					ret = (ch.ack_rx_value == ST7580_ACK)?(ST7580_OK):(ST7580_TXERR_NAK);					
					/* Reset the state machine */
					step = TXREQ_LOW;
					firstIter = true;
				}
				
			}
			else
			{
				ret = ST7580_TXERR_ACK_TMO;				
				/* Reset the state machine */
				step = TXREQ_LOW;
				ch.wait_ack = false;
				firstIter = true;
			}
			break;
	}		
	return ret;
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/******************* (C) COPYRIGHT 2017 STMicroelectronics *****END OF FILE****/
